<?php
/**
 * Created by PhpStorm.
 * User: Артемий
 * Date: 15.06.2017
 * Time: 23:54
 */


// Хеш для обмена данными
define("HASH_SALT", "FGKSCNWEJASDLNM");


// Определяет какой сервер используется - для отключения отправки СМС и прочих ф-ций которые не тесте не могут работать
// Или для переключения на тестовые сервера обработки запросов
define("IS_PRODUCTION_SERVER", "N");



if(IS_PRODUCTION_SERVER=='Y')
{
	define("POBEDA_COOKIE_NAME", "BITRIX_POBEDA");
}
else
{
	define("POBEDA_COOKIE_NAME", "BITRIX_POBEDA");
}
$CURRENT_PROTOCOL = (CMain::IsHTTPS()) ? "https://" : "http://";
define("CURRENT_PROTOCOL", $CURRENT_PROTOCOL);


#########################################################################################
#										ИНФОБЛОКИ										#
#########################################################################################
//define("IBLOCK_NEWS", "10");// Инфоблок новостей



#########################################################################################
#								ПОЛЬЗОВАТЕЛЬСКИЕ НАСТРОЙКИ								#
#########################################################################################
//define("UF_OFERTA_DEF_VALUE", "1"); // Оферта





